Revit 2027 API
FabricationConfiguration.GetAncillaryGroupName Method
 Gets the fabrication ancillary group and name for the specified fabrication ancillary identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetAncillaryGroupName(
	int ancillaryId
)
Public Function GetAncillaryGroupName (
	ancillaryId As Integer
) As String
public:
String^ GetAncillaryGroupName(
	int ancillaryId
)
member GetAncillaryGroupName :
        ancillaryId : int -> string
Parameters
ancillaryId Int32
 The fabrication ancillary database identifier of the ancillary.
Return Value
String
 The group and name of the ancillary.
Exceptions
Exception | Condition
ArgumentException |  The ancillary does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace